# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..Height Property
EnergyAnalysisSurface Class See Also
---
The height of the analytical rectangular geometry.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Height { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
public:
property double Height {
	double get ();
}
```

# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace